In [127]:
import pandas as pd
import numpy as np

# Pandas

## Agenda

* `Series`와 `DataFrame` 객체 소개
* `Series`와 `DataFrame`의 주요 도구: 인덱싱, 삭제, 연산, 정렬
* 기초 통계 활용

## 기본 설정

`pandas` 라이브러리는 보통 `pd` 라는 별칭으로 사용된다.

- `Series`와 `DataFrame`을 표로 보여줄 때 사용되는 행의 수 지정 가능 
- 기본 값은 60이다.

In [128]:
pd.options.display.max_rows = 20
print(pd.options.display.max_rows)

20

## 1.1 판다스 자료구조 소개

* 시리즈(`Series`)
* 데이터프레임(`DataFrame`)

### 1.1.1 시리즈(`Series`)

- 1차원 어레이와 동일한 구조 
- 인덱스(index)를 0, 1, 2 등이 아닌 임의의 값으로 지정

#### 시리스 생성 1

- 1차원 리스트 또는 np.array를 이용해 생성가능
- index = 0, 1, 2, ... 으로 생성

- 참고
    - 인덱스: 별도로 지정하지 않으면 리스트, 넘파이 어레이 등에서 사용된 인덱스가 기본으로 사용됨.
    - `dtype`: 사용된 항목의 자료형을 가리키며 모든 항목은 동일한 자료형을 가져야 함.

기본 Series 생성

In [129]:
ser_1 = pd.Series([4,2,43,-1])

In [130]:
ser_1.shape

(4,)

1차원 array를 이용한 생성

In [131]:
ser_2 = pd.Series(np.array([4,3,4,5,-1]))

항목으로 사용된 값들은 `values` 속성이 넘파이 어레이로 저장된다.

In [132]:
ser_2.values

array([ 4,  3,  4,  5, -1])

- series.index 를 통해 index확인 가능
- 자동으로 생성된 경우 인덱스는 `range`와 유사한 `RangeIndex` 자료형

In [133]:
print(type(ser_2))
for i in ser_2.index:
    print(i)

<class 'pandas.core.series.Series'>
0
1
2
3
4

#### 인덱스 지정
Series 생성시 index지정가능.

- `index` 키워드 인자: 항목의 수와 동일한 길이를 갖는 리스트. 리스트에 포함된 항목 순서대로 인덱스 지정.

In [134]:
ser_3 = pd.Series([4,3,3,1], index=["a","b","c","d"])
print(ser_2)

0    4
1    3
2    4
3    5
4   -1
dtype: int64

특정 인덱스를 지정시 인덱스의 자료형은 `Index` 객체로 할당된다.

In [135]:
ser_3.index

Index(['a', 'b', 'c', 'd'], dtype='object')

#### 인덱스 대체
- 기존에 사용된 인덱스를 완전히 새로운 인덱스로 대체할 수도 있다.

In [136]:
ser_3.index = ["hello","world","edadad","asdas"]
ser_3

hello     4
world     3
edadad    3
asdas     1
dtype: int64

#### 인덱싱
- 숫자가 아닌 index도 동일하게 적용

In [137]:
ser_2["a"]

KeyError: 'a'

인덱스가 가리키는 값을 변경할 수도 있다.

In [139]:
ser_2["d"] = 7
ser_2

0    4
1    3
2    4
3    5
4   -1
d    7
dtype: int64

인덱스의 리스트를 이용한 인덱싱의 결과는 지정된 인덱스가 사용

In [140]:
ser_2[["a","b","c"]]

KeyError: "None of [Index(['a', 'b', 'c'], dtype='object')] are in the [index]"

#### 부울 인덱싱(필터링)
- 부울 인덱싱은 넘파이 어레이의 경우와 동일하게 작동한다.

양수 항목들로만 구성된 시리즈 출력

In [141]:
ser_2[ser_2 >3]

0    4
2    4
3    5
d    7
dtype: int64

#### 연산 및 유니버설 함수 적용
- 연산 및 유니버설 함수 적용 방식도 기본적으로 넘파이 어레이의 경우처럼 항목별로 작동

In [142]:
ser_2 *2

0     8
1     6
2     8
3    10
4    -2
d    14
dtype: int64

In [143]:
ser_2 + 1

0    5
1    4
2    5
3    6
4    0
d    8
dtype: int64

#### 사전(`dict`)과 시리즈(`Series`) 비교
- 시리즈는 길이가 고정되었으며 순서가 중요한 사전으로 간주할 수 있다.

| 사전 | 시리즈 |
| :---: | :---:  |
| 키(key) | 인덱스 |
| 값 | 값    |
| 순서 없음 | 순서 중요 |
| 중복 없음 | 중복 허용 |

#### 시리즈 생성 2
dict2Series
- 키 => 인덱스
- 값 => 값

In [30]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [31]:
ser_4 = pd.Series(sdata)
print(ser_4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

- dict 을 이용하여 index 별도 지정가능
     - dict에 키로 사용되지 않은 index는 누락되었다는 의미로 `NaN`이 표기
- 인덱스 리스트에 포함되지 않는 (사전의) 키는 포함되지 않는다.

* `California`: `sdata` 사전에 키로 사용되지 않았기에 `Nan`으로 지정
* `Utah`: `states` 리스트에 포함되지 않았기에 생성된 시리즈에 사용되지 않음.

In [32]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [33]:
ser_5 = pd.Series(sdata, index=states)
print(ser_5)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

역으로 시리즈를 사전으로 변환할 수도 있다. 

* 인덱스 => 키
* 값 => 값

In [34]:
dict(ser_4)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

#### `in` 연산자
- `in`연산자는 인덱스 사용 여부를 사전 자료형의 키(key) 사용 여부와 동일한 방식으로 판단한다.

In [35]:
"Texas" in ser_4

True

#### 결측치 확인
- isnull
    - 누락된 항목은 `True`, 아니면 `False`로 지정하여 단번에 결측치가 포함되었는지 여부를 보여준다
- notnull
    - 누락된 항목은 `False`, 아니면 `True`로 지정하여 단번에 결측치가 포함되었는지 여부를 보여준다.

In [144]:
ser_5[ser_5.isnull()]

California   NaN
dtype: float64

In [145]:
ser_5.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

- `any()` 또는 `all()` 메서드를 활용하면 결측치 여부 확인가능
- 예를 들어, `pd.isnull()` 과 `any()` -> `True` 결측치 존재

In [146]:
ser_5.isnull().any()
#결측치가 존재한다.

True

In [147]:
np.sum(ser_5.isnull()) #결측치의 갯수 확인

1

- `pd.notnull()` 과 `all()` -> `False` 이면 결측재 존재

In [148]:
ser_5.notnull().all()
#all vs any

False

#### 시리즈 연산과 인덱스

- 시리즈가 공동으로 사용하는 항목에 대해서만 연산가능
- 다른 인덱스에 대한 연산결과로는 `NaN`으로 값 지정

In [149]:
print(ser_4)
print("===============")
print(ser_5)
print("===============")
print(ser_4+ser_5)

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: pop, dtype: int64
===============
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
===============
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [150]:
ser_4.name = "pop"
ser_4.index.name = "state"
print(ser_4)

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: pop, dtype: int64

## 1.2 데이터프레임(`DataFrame`)

__데이데프레임__(DataFrame) 
- 인덱스를 공유하는 여러 개의 시리즈를 다루는 객체다. 
- 2차원 Array, Matrix 라고 하기도 한다.
- row 와 column으로 구성, Series 는 row vector 라고 하기도 한다

<img src="https://s3.us-west-2.amazonaws.com/secure.notion-static.com/a5375a68-6cd1-4883-a747-5efe305e27b4/Untitled.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Credential=AKIAT73L2G45EIPT3X45%2F20220717%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20220717T133305Z&X-Amz-Expires=86400&X-Amz-Signature=eb0c260acf1503a77f4926d343e57ddc35b5cc3a0e16ecacf06afdb835fbf1bd&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22Untitled.png%22&x-id=GetObject" style="width:700px;">

- 세 개의 시리즈
- `name` 속성을 이용하여 각 시리즈의 이름도 함께 지정

In [151]:
# mango
series_1 = pd.Series([4,5,6,3,1],name="Mango")

In [152]:
# apple
series_2 = pd.Series([5,4,3,0,2],name="Apple")

In [153]:
# banana
series_3 = pd.Series([2,3,5,2,7],name="Banana")

In [154]:
series_1

0    4
1    5
2    6
3    3
4    1
Name: Mango, dtype: int64

<img src="https://s3.us-west-2.amazonaws.com/secure.notion-static.com/22162fb4-f914-489b-99ee-d6fbc441ba65/Untitled.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Credential=AKIAT73L2G45EIPT3X45%2F20220717%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20220717T133438Z&X-Amz-Expires=86400&X-Amz-Signature=4b08f8f2a17df6f87945256d9f02766e238fbdd5402e6b50aeadb11c44c99584&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22Untitled.png%22&x-id=GetObject">

### 데이터프레임 생성 1 (From a dict of lists)

- value 가  list인 dict 으로 부터 데이터 프레임 생성
- 데이터프레임 객체는 시리즈를 값으로 갖는 사전(`dict`) 객체를 이용하여 생성가능
- 위 세 개의 시리즈를 하나의 데이터프레임으로 묶기 위해 키(key)는 각 series `name`으로, 값(value)은 해당 series로 지정된 아래 사전을 이용한다.

```python
{"Mango":series1, "Apple":series2, "Banana":series3}
```

In [155]:
pd.DataFrame({series_1.name:series_1, series_2.name:series_2, series_3.name:series_3})

   Mango  Apple  Banana
0      4      5       2
1      5      4       3
2      6      3       5
3      3      0       2
4      1      2       7

- `name` 속성을 키로 지정한 후 데이터프레임 생성

In [156]:
pd.concat([series_1, series_2,series_3])

0    4
1    5
2    6
3    3
4    1
0    5
1    4
2    3
3    0
4    2
0    2
1    3
2    5
3    2
4    7
dtype: int64

In [157]:
pd.concat([series_1, series_2,series_3], axis = 1)

   Mango  Apple  Banana
0      4      5       2
1      5      4       3
2      6      3       5
3      3      0       2
4      1      2       7

- `pd.concat()` 함수도 여러 개의 시리즈를 묶어 하나의 데이터프레임을 생성
    - 축 지정
    - axis=1, axis=0

### 데이터프레임 생성 2 (From a list of dicts)
- Object가 dict인 list로부터 데이터 프레임 생성
- 리스트를 값으로 갖는 사전을 이용하여 데이터프레임을 생성 가능
- `state`(주 이름), `year`(년도), `pop`(인구)을 키(key)로 사용
- 해당 특성에 해당하는 데이터로 구성된 리스트를 값(value)로 사용

In [158]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada', 'NY', 'NY', 'NY'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003, 2002, 2003, 2004],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 8.3, 8.4, 8.5]}
# dict 를 DataFrame로 변경해보자

In [159]:
df_1 = pd.DataFrame(data)

In [160]:
df_1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4
8      NY  2004  8.5

#### `head()` 메서드
- `head()` : 지정된 크기만큼의 행을 출력 
- 처음 5개의 행을 보여준다.

In [161]:
df_1.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

#### `tail()` 메서드
- `tail()` : 지정된 크기만큼의 행을 뒤에서부터 출력 
- 뒤에서부터 5개의 행을 보여준다.

In [162]:
df_1.tail()

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4
8      NY  2004  8.5

### 데이터프레임 생성3 (From another DataFrame)
- `columns` 속성을 이용하여 열의 순서를 지정하여 기존 datafram을 이용해 새로운 datafram을 생성할 수 있다.

In [163]:
pd.DataFrame(data, columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2
6  2002      NY  8.3
7  2003      NY  8.4
8  2004      NY  8.5

In [164]:
pd.DataFrame(data, columns=["state","pop"])

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5  Nevada  3.2
6      NY  8.3
7      NY  8.4
8      NY  8.5

- 새로운 열을 추가 가능
- 이름만 지정하고 value가 없다면 항목은 모두 `NaN`으로 처리

In [165]:
pd.DataFrame(data, columns=["state","population"])

    state population
0    Ohio        NaN
1    Ohio        NaN
2    Ohio        NaN
3  Nevada        NaN
4  Nevada        NaN
5  Nevada        NaN
6      NY        NaN
7      NY        NaN
8      NY        NaN

- 사전에 항목을 추가하듯이 처리 가능

In [166]:
data_1 = pd.DataFrame(data, columns=["year","state","pop","debt"])
data_1["debt"] = np.random.randint(0,10,size=9)

 -`columns` 속성을 확인

In [167]:
data_1.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

#### `index` 속성
- 인덱스를 지정하려면 `index` 속성을 이용

In [168]:
df_2 = pd.DataFrame(data, index=["one","two","three","four","five","six","seven","eight","nine"])
df_2

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2
seven      NY  2002  8.3
eight      NY  2003  8.4
nine       NY  2004  8.5

In [169]:
df_3 = pd.DataFrame(data,
                    index = ["one","two","three","four","five","six","seven","eight","nine"],
                    columns = ["year","state","pop","debt"])
df_3

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN
seven  2002      NY  8.3  NaN
eight  2003      NY  8.4  NaN
nine   2004      NY  8.5  NaN

- `columns`, `index` 등 여러 속성을 동시에 지정

### 열(column) 인덱싱

- 열 인덱싱은 시리즈, 사전 등과 동일한 방식을 사용
- 지정된 열의 이름을 사용하여 확인가능
```
df.[‘column_name’]
```

In [170]:
df_3["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
seven        NY
eight        NY
nine         NY
Name: state, dtype: object

- 대괄호 대신 속성 형식을 사용할 수도 있다.
```
df.column_name
```

In [171]:
df_3.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
seven        NY
eight        NY
nine         NY
Name: state, dtype: object

__참고__ 
- 속성 형식에 사용될 수 있는 열의 이름은 일반 변수의 이름 지정방식과 동일하게 사용해야 한다. 
- 대괄호를 사용하는 인덱싱은 임의의 문자열을 사용하지만 속성 형식은 변수를 사용하듯이 처리하기 때문 

예 
- Ohio 주(state)인지 여부를 판정하는 'Ohio state' 라는 열을 추가

In [172]:
df_3["Ohio state"] = df_3.state == "Ohio"
df_3

       year   state  pop debt  Ohio state
one    2000    Ohio  1.5  NaN        True
two    2001    Ohio  1.7  NaN        True
three  2002    Ohio  3.6  NaN        True
four   2001  Nevada  2.4  NaN       False
five   2002  Nevada  2.9  NaN       False
six    2003  Nevada  3.2  NaN       False
seven  2002      NY  8.3  NaN       False
eight  2003      NY  8.4  NaN       False
nine   2004      NY  8.5  NaN       False

### 열 삭제
- 하나의 열을 삭제하려면 `del` 예약어를 사용한다.

In [173]:
del df_3["Ohio state"]

- `drop()` 메서드를 사용가능

In [174]:
df_3.drop(columns="Ohio_state")
#뷰만 보여주고 실제로 삭제된 건 아님

KeyError: "['Ohio_state'] not found in axis"

In [175]:
df_3.drop(columns="Ohio_state", inplace=True)
#inplace : 메모리에 있는 df의 값을 변경하고 반영할 때
df_3

KeyError: "['Ohio_state'] not found in axis"

### 행 인덱싱
- 행 인덱싱은 `loc` 속성과 지정된 인덱스를 이용
    - location 의 약자로 column의 label, 또는 boolean array로 접근

In [176]:
df_3.loc["three"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

- 인덱스의 리스트를 활용
    - boolean 을 이용해 특정 조건의 행 선택

In [177]:
df_3.loc[["three","one"]]

       year state  pop debt
three  2002  Ohio  3.6  NaN
one    2000  Ohio  1.5  NaN

__참고__ 
- iloc를 이용해 정수 인덱싱 가능
    - integer location 의 약자로 indexing 값으로 데이터에 접근

In [178]:
df_3.iloc[1:3]

       year state  pop debt
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

### 열 업데이트

- 열 인덱싱을 이용하여 항목의 값을 지정및 변경 가능 
    - 브로드캐스팅이 기본적으로 작동한다.

In [179]:
df_3["debt"] = 16.2
df_3

       year   state  pop  debt
one    2000    Ohio  1.5  16.2
two    2001    Ohio  1.7  16.2
three  2002    Ohio  3.6  16.2
four   2001  Nevada  2.4  16.2
five   2002  Nevada  2.9  16.2
six    2003  Nevada  3.2  16.2
seven  2002      NY  8.3  16.2
eight  2003      NY  8.4  16.2
nine   2004      NY  8.5  16.2

- 행의 길이와 동일한 리스트, 어레이 등을 이용하여 각 행별로 다른 값을 지정가능
- 리스트, 어레이의 길이가 행의 개수와 동일해야한다.

In [180]:
df_3["debt"] = np.arange(9)
df_3

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5
seven  2002      NY  8.3     6
eight  2003      NY  8.4     7
nine   2004      NY  8.5     8

- __Series__ 를 이용하여 특정 열의 값을 지정가능 
    - 항목의 길이가 행의 개수와 동일할 필요가 없다.
    - 지정된 행의 인덱스 값만 삽입되며 나머지는 `NaN`이 삽입

In [181]:
val = pd.Series([-1.2, -1.5, -1.7, 2.2], index=['two', 'four', 'five', 'eleven'])
val
# 위 시리즈를 이용하여 `'debt'` 열의 값을 업데이트

two      -1.2
four     -1.5
five     -1.7
eleven    2.2
dtype: float64

In [182]:
df_3[]

SyntaxError: invalid syntax (2353673055.py, line 1)

### 데이터프레임 생성 3 (From a dict of dicts)

- 중첩 사전을 활용하여 데이터프레임을 생성가능
- 최상위 키는 열의 이름으로, 내부에 사용된 키는 행의 인덱스로 사용

__참고__ 
- 데이터프레임을 생성함에 있어서의 핵심은 2차원 행렬 모양을 갖느냐이기에
- 각 열에 해당하는 값으로 리스트, 어레이, 사전, 시리즈 등이 사용될 수 있다.

In [183]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, #nevada ohio: 열의 이름 2001 2002: 행의 인덱스
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [184]:
pd.DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

- 중첩 사전을 이용하여 데이터프레임을 생성
- 두 사전의 키가 다른경우 결측치 저리 된다.

- 하나의 사전을 시리즈로 본다면 여러 개의 사전으로 데이터 프레임을 생성할수 있다. 
```
pd.concat
```

In [185]:
nevada = pd.Series({2001: 2.4, 2002: 2.9}, name="Nevada")
nevada

2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [186]:
ohio = pd.Series({2000: 1.5, 2001: 1.7, 2002: 3.6}, name="Ohio")
ohio

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

- 두 시리즈를 합치면 위 결과와 동일하다.

In [187]:
pd.concat([nevada, ohio], axis=1)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

### 전치 데이터프레임
- 2차원 행렬의 전치 행렬처럼 전치 데이터프레임은 행과 열의 위치를 변경한다.

In [188]:
df_3.T

        one   two three    four    five     six seven eight  nine
year   2000  2001  2002    2001    2002    2003  2002  2003  2004
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada    NY    NY    NY
pop     1.5   1.7   3.6     2.4     2.9     3.2   8.3   8.4   8.5
debt      0     1     2       3       4       5     6     7     8

### `name`/`values` 속성
- Series 경우와 동일한 방식으로 행과 열의 이름을 지정 가능
- 항목들로 이루어진 2차원 어레이는 `values` 속성이 가리킨다.

In [189]:
df_3.index.name = "year"
df_3

       year   state  pop  debt
year
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5
seven  2002      NY  8.3     6
eight  2003      NY  8.4     7
nine   2004      NY  8.5     8

In [190]:
df_3.columns.name = "state"
df_3

state  year   state  pop  debt
year
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5
seven  2002      NY  8.3     6
eight  2003      NY  8.4     7
nine   2004      NY  8.5     8

## 1.3 인덱스 객체

### `index` 속성
- 시리즈와 데이터프레임의 인덱스는 `Index` 속성값으로 지정

- 인덱스 객체는 1차원 어레이와 유사하게 동작
- 예를 들어, 인덱싱과 슬라이싱은 리스트 또는 1차원 어레이의 경우와 동일하게 작동

### `columns` 속성
- 열(columns)에 사용된 이름은 `Index` 객체로 `columns` 속성값으로 지정

### `in` 연산자
- 인덱스와 열에 대한 특정 이름의 사용 여부는 `in` 연산자를 이용하여 확인

In [122]:
"pop" in df_3.columns

True

### 중복 인덱스
- 인덱스를 중복해서 사용 가능

In [125]:
labels = pd.Index(["one","two","two","three","three","three"])

In [126]:
pd.DataFrame(df_3, index= labels)

state  year state  pop  debt
one    2000  Ohio  1.5     0
two    2001  Ohio  1.7     1
two    2001  Ohio  1.7     1
three  2002  Ohio  3.6     2
three  2002  Ohio  3.6     2
three  2002  Ohio  3.6     2